huzhekun/stadia-dongle-passthrough/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# BLE - NimBLE only (no Bluedroid)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096

# TinyUSB - custom Stadia HID class driver (stadia_dev.c)
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_VENDOR_COUNT=0

# Override Espressif's default VID/PID with Stadia Controller identifiers.
# When these are enabled, the ESP-IDF TinyUSB wrapper ignores the custom
# device descriptor and substitutes Espressif (303A) VID/PID — causing
# Windows to fail with "device cannot start (Code 10)" since the Stadia
# driver won't match.
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_VID=0x18D1
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x9400
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Google Inc."
CONFIG_TINYUSB_DESC_PRODUCT_STRING="Stadia Controller"
CONFIG_TINYUSB_DESC_SERIAL_STRING="ESP32STADIA001"

# Flash layout used by the web installer merged image
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Logging - silence all output in production to minimise UART interrupt overhead
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL=0

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
